<template>
  <div class="about">
    <h1>Про нас</h1>
    <p>
      У нашій компанії ми прагнемо створювати більше, ніж просто товари і послуги.
      Наша мета - забезпечити вам незабутнє враження і зробити процес покупки чогось особливого.
    </p>
    <p>
      Ми віримо, що відносини з нашими клієнтами базуються на довірі.
      Тому ми ставимо перед собою завдання побудувати довготривалі стосунки з кожним з вас.
      Ми розуміємо, що ваші потреби і бажання унікальні, тому ми працюємо над тим,
      щоб зробити ваше досвід з нами якомога більш персоналізованим і задовольнити навіть найвибагливіші очікування.
    </p>
    <p>
      На нашому сайті ви знайдете великий вибір автомобілів,
      а також інформацію про їх характеристики, вартість, власника та багато іншого.</p>
    <p>
      Ми також відкриті до співпраці з нашими клієнтами та завжди раді отримати ваші пропозиції та відгуки.
      Ваше задоволення - наш пріоритет, і ми прагнемо досягти ваших високих очікувань.
    </p>
    <p>
      Якщо у вас є будь-які запитання або потреба в додатковій інформації, будь ласка,
      зв'яжіться з нами за номером <span class="phone">+380639000635</span>
    </p>
  </div>
</template>
<script lang="ts">
import { defineComponent } from 'vue';

// components

export default defineComponent({
  name: 'AboutUs',
  components: {
  },
});
</script>
<style lang="scss" scoped>
@import "src/styles/typography";
@import "src/styles/colors";
@import "src/styles/mixins";

.about {
  @include typo-headline-4;
  text-align: start;
  padding: 2rem;
  .phone {
    color: $color-neutrals-6;
  }
}

</style>
